package hometask02;
/*Создать класс, который содержит int и char (не проинициализированные) и распечатать 
их значения.*/
public class InicializaciyaPoUmolchaniu {

	public static void main(String[] args) {
		int t = 0;
		char r = 0;
		//System.out.println(t);
		System.out.print(r);
	}

}
